{
  "id": "fintech-techfin-001",
  "title": "핀테크 & 테크핀",
  "category": "digital-service",
  "subcategory": "Finance",
  "subjectCategories": [
    "DS",
    "MG"
  ],
  "difficulty": "intermediate",
  "certifications": [
    "information-management"
  ],
  "keywords": [
    "FinTech",
    "TechFin",
    "Digital Banking",
    "Open Banking",
    "Embedded Finance"
  ],
  "definition": "핀테크는 금융+기술 융합, 테크핀은 빅테크 기업의 금융 서비스 진출로, 디지털 금융 혁신을 의미 기술.",
  "functions": [
    "핀테크(FinTech)와 테크핀(TechFin)은 기술을 활용하여 기존 금융 서비스의 방식과 제공 형태를 혁신하는 다양한 기능들을 제공합니다.",
    "**간편 결제 및 송금**:",
    "**모바일 간편 결제**: 스마트폰 앱을 통해 QR 코드, 바코드, NFC, 지문 등으로 빠르고 편리하게 결제할 수 있는 기능. (예: 삼성페이, 카카오페이, 애플페이)",
    "**모바일 송금**: 은행 앱이나 핀테크 앱을 통해 계좌 번호나 연락처만으로 간편하게 송금할 수 있는 기능. (예: 토스 송금, 페이팔)",
    "**해외 송금 서비스**: 블록체인 등 신기술을 활용하여 저렴하고 빠르게 국제 송금을 처리.",
    "**자산 관리 및 투자**:",
    "**로보 어드바이저 (Robo-Advisor)**: AI 알고리즘이 고객의 투자 성향과 목표를 분석하여 포트폴리오를 추천하고 자산을 자동 관리하는 서비스. (예: 쿼터백, 파운트)",
    "**개인 맞춤형 자산 관리**: AI 기반으로 개인의 지출 패턴, 소득 등을 분석하여 예산 관리, 저축 목표 달성 등을 지원.",
    "**소액 투자 및 P2P (Peer-to-Peer) 대출**: 소액으로 주식, 펀드, 부동산 등에 투자하거나, 개인 간 직접 대출 및 투자를 중개.",
    "**오픈 뱅킹 (Open Banking) 및 API**:",
    "**API (Application Programming Interface) 연동**: 금융 기관의 데이터를 표준화된 API 형태로 제3자 핀테크 기업에 공개하여, 다양한 금융 서비스를 개발하고 통합할 수 있도록 합니다.",
    "**데이터 통합**: 여러 은행의 계좌 정보, 거래 내역 등을 하나의 앱에서 조회하고 관리할 수 있는 기능. (예: 마이데이터 서비스)",
    "**대출 및 신용 평가**:",
    "**대안 신용 평가**: 비금융 데이터(통신료 납부 기록, 이커머스 구매 내역 등)를 AI로 분석하여 전통적인 금융권에서 대출이 어려웠던 고객에게도 신용 평가 및 대출 기회를 제공.",
    "**온라인 대출**: 간편한 절차로 모바일 앱을 통해 소액 대출을 신청하고 실행.",
    "**보험 테크 (InsurTech)**:",
    "**개인 맞춤형 보험 상품**: 빅데이터와 AI를 활용하여 고객의 생활 습관, 건강 데이터 등을 분석하여 개인에게 최적화된 보험 상품 추천 및 제공.",
    "**간편 보험 가입/청구**: 모바일 앱을 통해 보험 가입 및 보험금 청구 절차를 간소화.",
    "**블록체인 기반 금융 서비스**:",
    "**분산원장기술 (DLT)**: 거래의 투명성과 보안성을 높이고, 중개자 없이 금융 거래를 가능하게 합니다. (예: CBDC, 암호화폐 거래).",
    "이러한 기능들은 사용자의 금융 생활을 더욱 편리하고 효율적으로 만들며, 금융 서비스의 새로운 가치를 창출합니다."
  ],
  "characteristics": [
    "핀테크: 금융 회사가 기술 도입, 간편결제, 송금, 자산관리",
    "테크핀: 빅테크(네이버, 카카오, 알리바바)가 금융 진출",
    "주요 분야: 간편결제, P2P 대출, 로보어드바이저, 크라우드펀딩, 보험테크",
    "Open Banking: API로 금융 데이터 공유, PSD2 (유럽), 금융 플랫폼",
    "Embedded Finance: 비금융 서비스에 금융 내재화 (우버 결제, 쇼피파이 대출)",
    "AI 활용: 신용평가, 사기 탐지, 챗봇 고객 지원, 투자 추천",
    "규제: 핀테크 샌드박스, 혁신금융서비스, 마이데이터",
    "사례: Stripe, PayPal, Toss, Kakao Pay, Revolut"
  ],
  "relatedTopics": [
    "blockchain-001",
    "ai-deep-learning-001"
  ],
  "importance": 4,
  "trends": [
    "Embedded Finance",
    "Open Banking"
  ],
  "tags": [
    "2025"
  ]
}