{
  "id": "supply-chain-security-sbom-001",
  "title": "공급망 보안 (SBOM)",
  "category": "digital-service",
  "subcategory": "공급망 보안",
  "subjectCategories": [
    "IS"
  ],
  "difficulty": "advanced",
  "certifications": [
    "information-management",
    "computer-systems"
  ],
  "keywords": [
    "공급망 보안",
    "SBOM",
    "소프트웨어 자재 명세서",
    "오픈소스 보안"
  ],
  "definition": "공급망 보안은 소프트웨어 개발 및 배포 과정 전반에 걸쳐 발생하는 보안 위협으로부터 시스템을 보호하는 것을 목표로 합니다. 특히, SBOM(Software Bill of Materials)은 소프트웨어를 구성하는 모든 구성 요소(오픈소스, 상용 라이브러리, 의존성 등)의 목록을 제공하여 소프트웨어 공급망의 투명성을 확보하고 잠재적 취약점을 관리하는 데 필수적인 도구 기술.",
  "technicalElements": [
    "공급망 보안 강화의 핵심 도구인 SBOM(Software Bill of Materials)은 다음과 같은 기술 요소들로 구성됩니다.",
    "**SBOM 구성 요소**:",
    "**컴포넌트 식별**: 소프트웨어를 구성하는 모든 상업용 및 오픈소스 컴포넌트(라이브러리, 프레임워크, 모듈)의 이름, 버전, 공급업체 등 식별자.",
    "**라이선스 정보**: 각 컴포넌트의 사용 라이선스(예: MIT, Apache 2.0, GPL) 정보. 이는 오픈소스 컴플라이언스 관리에 필수적입니다.",
    "**해시 값**: 각 컴포넌트의 고유성을 보장하는 암호화 해시 값(예: SHA-256). 무결성 검증 및 위변조 탐지에 활용됩니다.",
    "**관계 정보**: 컴포넌트 간의 종속성(Dependency) 및 계층 구조.",
    "**작성자 및 생성일**: SBOM을 생성한 주체와 생성 시점.",
    "**SBOM 교환 표준**:",
    "다양한 도구와 시스템 간에 SBOM 정보를 효율적으로 공유하기 위한 표준화된 형식입니다.",
    "**SPDX (Software Package Data Exchange)**: 리눅스 재단(Linux Foundation)이 주도하는 표준으로, 소프트웨어 컴포넌트, 라이선스, 저작권 정보를 포함합니다.",
    "**CycloneDX**: OWASP가 주도하는 표준으로, 보안 취약점 관리 및 공급망 보안에 중점을 둡니다. BOM(Bill of Materials) 정보를 XML 또는 JSON 형식으로 표현합니다.",
    "**SBOM 생성 도구**:",
    "**오픈소스 분석 도구**: 소스 코드나 바이너리를 스캔하여 오픈소스 컴포넌트를 식별하고 SBOM을 생성합니다 (예: SPDX Tools, CycloneDX CLI, OWASP Dependency-Check, Black Duck).",
    "**빌드 시스템 통합**: CI/CD 파이프라인에 SBOM 생성 도구를 통합하여 소프트웨어 빌드 시 자동으로 SBOM을 생성합니다.",
    "**컨테이너 이미지 스캐너**: 컨테이너 이미지 내의 소프트웨어 컴포넌트를 분석하여 SBOM을 생성합니다.",
    "**SBOM 분석 및 관리 도구**:",
    "**취약점 관리 시스템 (VMS, Vulnerability Management System)**: SBOM 정보를 활용하여 소프트웨어에 포함된 컴포넌트의 알려진 보안 취약점(CVE 등)을 식별하고 관리합니다.",
    "**오픈소스 컴플라이언스 관리 (OSCM)**: SBOM의 라이선스 정보를 기반으로 오픈소스 라이선스 정책 위반 여부를 확인하고 관리합니다.",
    "**위협 인텔리전스 연동**: SBOM의 컴포넌트 정보와 최신 위협 인텔리전스를 연동하여 잠재적 공격 노출을 분석합니다.",
    "**공급망 보안 정책 및 거버넌스**:",
    "SBOM을 효과적으로 활용하기 위한 정책 수립, 책임 할당, 프로세스 정의 등의 관리적 요소도 중요합니다.",
    "이러한 기술 요소들은 소프트웨어 공급망의 투명성을 높이고, 잠재적인 보안 위험을 사전에 식별하고 관리하여 공급망 공격에 대한 회복 탄력성을 강화하는 데 기여합니다."
  ],
  "characteristics": [
    "소프트웨어 공급망 공격: 개발 환경, 빌드 시스템, 배포 파이프라인 등을 통해 악성코드를 주입하거나 취약점을 악용하는 공격.",
    "SBOM (Software Bill of Materials): 소프트웨어 구성 요소의 명세서로, 마치 제품의 성분표와 같습니다. 구성 요소의 이름, 버전, 라이선스, 해시 값 등을 포함합니다.",
    "투명성 확보: SBOM을 통해 소프트웨어에 포함된 모든 구성 요소를 파악하고, 알려진 취약점 유무를 신속하게 확인할 수 있습니다.",
    "취약점 관리: SBOM 정보를 기반으로 소프트웨어에 포함된 오픈소스 및 라이브러리의 취약점을 식별하고 패치 우선순위를 결정합니다.",
    "컴플라이언스: 특정 산업이나 국가에서는 SBOM 제출을 의무화하고 있습니다 (예: 미국 행정명령)."
  ],
  "relatedTopics": [
    "security-attack-001",
    "sdlc-001"
  ],
  "importance": 4,
  "trends": [
    "국가별 SBOM 의무화",
    "SBOM 교환 표준 (SPDX, CycloneDX)",
    "자동화된 SBOM 생성 및 분석"
  ]
}